backend/packages_MonProjet.puml
@startuml packages_MonProjet
set namespaceSeparator none
package "api" as api {
}
package "api.admin" as api.admin {
}
package "api.auth_views" as api.auth_views {
}
package "api.authentication" as api.authentication {
}
package "api.firebase_service" as api.firebase_service {
}
package "api.management" as api.management {
}
package "api.management.commands" as api.management.commands {
}
package "api.management.commands.firebase_push_claims" as api.management.commands.firebase_push_claims {
}
package "api.migrations" as api.migrations {
}
package "api.migrations.0001_initial" as api.migrations.0001_initial {
}
package "api.migrations.0002_order_line_items_user_firebase_uid" as api.migrations.0002_order_line_items_user_firebase_uid {
}
package "api.models" as api.models {
}
package "api.permissions" as api.permissions {
}
package "api.serializers" as api.serializers {
}
package "api.services" as api.services {
}
package "api.services.user_sync" as api.services.user_sync {
}
package "api.urls" as api.urls {
}
package "api.views" as api.views {
}
api.admin --> api.models
api.auth_views --> api.authentication
api.auth_views --> api.services.user_sync
api.authentication --> api.firebase_service
api.authentication --> api.services.user_sync
api.management.commands.firebase_push_claims --> api.services.user_sync
api.serializers --> api.models
api.services --> api.services.user_sync
api.services.user_sync --> api.firebase_service
api.urls --> api.auth_views
api.urls --> api.views
api.views --> api.authentication
api.views --> api.models
api.views --> api.permissions
api.views --> api.serializers
@enduml
